Revit 2027 API
ParameterTypeId.AreaTypeText Property
 "Area Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AreaTypeText { get; }
Public Shared ReadOnly Property AreaTypeText As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AreaTypeText {
	ForgeTypeId^ get ();
}
static member AreaTypeText : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace